# language: ru

@deliveryclub
Функционал: Автоматизация страницы delivery-club

  Сценарий: Открыть странцину
    Пусть пользователь открыл главную страницу
    И пользователь ввел в поле с плейсхолдером "Город, улица, дом" текст "Москва, Большая Новодмитровская улица, 14с1"
    И пользователь нажал на кнопку Найти рестораны
    И пользователь нажал на чекбокс "Фастфуд"
    И пользователь нажал на чекбокс "Бургеры"
    И пользователь нажал на ссылку Сити Пицца
    И пользователь выбрал меню по названию Мини хотдоги и нажал на кнопку заказать
    #И пользователь выбрал меню по названию Лонгер BBQ и нажал на кнопку заказать
    #И пользователь нажал на кнопку заказать
    И пользователь нажал на радио-кнопку "9 шт"
    И пользователь нажал кнопку Добавить в заказ
    И пользователь выбрал меню по названию Ассорти "СИТИПИЦЦА" №1 и нажал на кнопку заказать
    #И пользователь выбрал меню по названию Шаурма «Ливанская» и нажал на кнопку заказать
    #И пользователь нажал на радио-кнопку "310 г"
    #И пользователь нажал на чекбокс "Телятина 50 г"
    #И пользователь нажал на чекбокс "Курица 50 г"
    #И пользователь нажал на кнопку Корзина
    И пользователь ждет 100 сек

